int/resources/objectRepo/xmlTemplates/opera/CommissionConfig/req_CreateConfigBankAccounts.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateConfigBankAccountsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:BankAccounts>
            <v91:BankAccount>
               <v91:HotelCode/>
               <v91:BankAccountID/>
               <v91:BankAccountNumber/>
               <v91:BankCode/>
               <v91:BranchCode/>
               <v91:BankName/>
               <v91:RoutingNumber/>
               <v91:PaymentMethod/>
               <v91:Format/>
               <v91:NextCheckNumber/>
               <v91:MinProcessingAmount/>
               <v91:Currency/>
               <v91:CheckStubLines/>
               <v91:Language/>
               <v91:SourceImportDirectory/>
               <v91:TargetImportDirectory/>
               <v91:EditCheckNumber/>
               <v91:ValidateIATANumber/>
               <v91:Default/>
               <v91:DefaultForCurrency/>
               <v91:PositivePayExport/>
               <v91:Report1099/>
            </v91:BankAccount>
         </v9:BankAccounts>
         <v9:UpdateDefault/>
         <v9:UpdateDefaultForCurrency/>
      </v9:CreateConfigBankAccountsRQ>
   </soapenv:Body>
</soapenv:Envelope>